["Which merchants joined in 2023?", "What is the average delivery time for orders?", "List all Italian cuisine items priced above $15", "How many orders did merchant ID 12345 process?", "What's the most expensive item offered by 'Joe's Pizzeria'?", "Which city has the most merchants?", "What's the average order value for sushi items?", "List all merchants in New York with their join dates", "Which eater placed the highest value single order?", "What's the busiest hour for order placements?", "How many unique cuisine tags exist in the system?", "List all drivers who took more than 30 minutes to arrive", "What percentage of orders contain Mexican food?", "Which merchant offers the most vegetarian options?", "What's the average time between order placement and pickup?", "List all items priced between $10 and $20 from Italian restaurants", "Which eater has placed the most orders?", "What's the total revenue generated from pizza items?", "How many new merchants joined last month?", "What's the average item price for Chinese cuisine?", "List all orders that took over an hour to deliver", "Which merchant has the highest average order value?", "What's the distribution of order values?", "List all vegan items sorted by price", "How many orders are placed during lunch hours (11am-2pm)?", "Which cuisine is most popular in each city?", "What's the average delivery time by merchant?", "List all merchants who joined before 2022", "What's the busiest day of week for orders?", "How many orders contain multiple cuisine types?", "What's the most common item ordered?", "List all merchants offering gluten-free options", "What's the average order value by time of day?", "How many unique eaters placed orders last week?", "Which merchant has the fastest average delivery time?", "List all orders with exactly 3 items", "What's the price range for burger items?", "How many merchants offer both pizza and pasta?", "What's the average driver wait time at pickup?", "List all items that have never been ordered", "What's the most expensive order ever placed?", "How many eaters have placed only one order?", "Which merchant has the most diverse menu?", "What's the average number of orders per eater?", "List all merchants with average order value above $50", "What percentage of orders are delivered within 30 minutes?", "Which city has the highest average order value?", "List all items that increased in price this year", "What's the most popular cuisine for dinner orders?", "How many merchants don't have any Italian items?", "What's the average delivery time difference between cities?", "List all eaters who haven't ordered in the last 30 days", "Which item appears most frequently in high-value orders?", "What's the peak order volume hour for each cuisine?", "How many merchants specialize in only one cuisine?", "List all orders with delivery time exceeding estimate", "What's the average order value for first-time vs returning eaters?", "Which merchant has the most repeat customers?", "List all items ordered by eater ID 7890", "What's the busiest order day in each month?", "How many orders contain items from multiple merchants?", "What's the most popular add-on item?", "List all merchants with declining order volume", "What's the average delivery distance?", "Which eaters always order the same cuisine?", "List all merchants with perfect delivery times", "What's the order cancellation rate?", "Which item is most commonly paired with drinks?", "List all eaters who order at unusual hours", "What's the average preparation time per cuisine?", "Which merchant has the most seasonal items?", "List all orders with driver wait time over 15 minutes", "What's the most popular cuisine for late-night orders?", "How many eaters order from only one merchant?", "List all merchants with increasing monthly order volume", "What's the average time between orders for repeat customers?", "Which item has the most price variations?", "List all eaters who order premium items frequently", "What's the order volume during holidays vs regular days?", "Which merchant has the most loyal customers?", "List all items that are exclusive to one merchant", "What's the average order value growth rate?", "Which city has the most diverse food options?", "List all merchants with consistently fast deliveries", "What's the most popular cuisine for office lunch orders?", "How many eaters try a new cuisine each month?", "List all merchants with 24/7 availability", "What's the average delivery time by weather condition?", "Which item has the highest profit margin?", "List all eaters who order healthy items exclusively", "What's the order frequency distribution by eater?", "Which merchant has the highest customer satisfaction?", "List all seasonal items available right now", "What's the average order value for group orders?", "Which cuisine has the fastest average preparation time?", "List all merchants with Valentine's Day specials", "What's the most popular combo meal?", "How many eaters order from multiple cities?", "List all merchants with sustainable packaging", "What's the average delivery time for vegan vs non-vegan orders?", "Which item has the most consistent pricing across merchants?", "List all eaters who tip above average", "What's the order volume impact of weather events?", "Which merchant has the most innovative menu?", "List all gluten-free merchants in Chicago", "What's the customer retention rate by merchant?", "Which cuisine has the highest average order value?", "List all merchants who offer loyalty programs", "What's the most popular item for first-time orders?", "How many eaters order from competitors?", "List all merchants with fastest response times"]